ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/timer32.xml
<module id="Timer32" HW_revision=""><register id="LOAD1" width="32" offset="0x0" internal="0" description="Timer 1 Load Register"><bitfield id="LOAD" description="The value from which the Timer 1 counter decrements" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="VALUE1" width="32" offset="0x4" internal="0" description="Timer 1 Current Value Register"/><register id="CONTROL1" width="32" offset="0x8" internal="0" description="Timer 1 Timer Control Register"><bitfield id="ONESHOT" description="Selects one-shot or wrapping counter mode" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ONESHOT__0" value="0x0" description="wrapping mode"/><bitenum id="ONESHOT__1" value="0x1" description="one-shot mode"/></bitfield><bitfield id="SIZE" description="Selects 16 or 32 bit counter operation  " begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="SIZE__0" value="0x0" description="16-bit counter"/><bitenum id="SIZE__1" value="0x1" description="32-bit counter"/></bitfield><bitfield id="PRESCALE" description="Prescale bits" begin="3" end="2" width="2" rwaccess="R/W"><bitenum id="PRESCALE__0" value="0x0" description="0 stages of prescale, clock is divided by 1"/><bitenum id="PRESCALE__1" value="0x1" description="4 stages of prescale, clock is divided by 16"/><bitenum id="PRESCALE__2" value="0x2" description="8 stages of prescale, clock is divided by 256"/></bitfield><bitfield id="IE" description="Interrupt enable bit" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="IE__0" value="0x0" description="Timer interrupt disabled"/><bitenum id="IE__1" value="0x1" description="Timer interrupt enabled"/></bitfield><bitfield id="MODE" description="Mode bit  " begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="MODE__0" value="0x0" description="Timer is in free-running mode"/><bitenum id="MODE__1" value="0x1" description="Timer is in periodic mode"/></bitfield><bitfield id="ENABLE" description="Enable bit  " begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Timer disabled"/><bitenum id="ENABLE__1" value="0x1" description="Timer enabled"/></bitfield></register><register id="INTCLR1" width="32" offset="0xC" internal="0" description="Timer 1 Interrupt Clear Register"><bitfield id="INTCLR" description="Any write to the T32INTCLR1 register clears the&#10;&#9;&#9;&#9;&#9;&#9; interrupt" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="RIS1" width="32" offset="0x10" internal="0" description="Timer 1 Raw Interrupt Status Register"><bitfield id="RAW_IFG" description="Raw interrupt status from the counter" begin="0" end="0" width="1" rwaccess="R/W"/></register><register id="MIS1" width="32" offset="0x14" internal="0" description="Timer 1 Interrupt Status Register"/><register id="BGLOAD1" width="32" offset="0x18" internal="0" description="Timer 1 Background Load Register"><bitfield id="BGLOAD" description="Contains the value from which the counter decrements" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="LOAD2" width="32" offset="0x20" internal="0" description="Timer 2 Load Register"><bitfield id="LOAD" description="The value from which the Timer 2 counter decrements" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="VALUE2" width="32" offset="0x24" internal="0" description="Timer 2 Current Value Register"><bitfield id="VALUE" description="Reports the current value of the decrementing&#10;&#9;&#9;&#9;&#9;&#9; counter" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="CONTROL2" width="32" offset="0x28" internal="0" description="Timer 2 Timer Control Register"><bitfield id="ONESHOT" description="Selects one-shot or wrapping counter mode" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ONESHOT__0" value="0x0" description="wrapping mode"/><bitenum id="ONESHOT__1" value="0x1" description="one-shot mode"/></bitfield><bitfield id="SIZE" description="Selects 16 or 32 bit counter operation  " begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="SIZE__0" value="0x0" description="16-bit counter"/><bitenum id="SIZE__1" value="0x1" description="32-bit counter"/></bitfield><bitfield id="PRESCALE" description="Prescale bits" begin="3" end="2" width="2" rwaccess="R/W"><bitenum id="PRESCALE__0" value="0x0" description="0 stages of prescale, clock is divided by 1"/><bitenum id="PRESCALE__1" value="0x1" description="4 stages of prescale, clock is divided by 16"/><bitenum id="PRESCALE__2" value="0x2" description="8 stages of prescale, clock is divided by 256"/></bitfield><bitfield id="IE" description="Interrupt enable bit" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="IE__0" value="0x0" description="Timer interrupt disabled"/><bitenum id="IE__1" value="0x1" description="Timer interrupt enabled"/></bitfield><bitfield id="MODE" description="Mode bit  " begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="MODE__0" value="0x0" description="Timer is in free-running mode"/><bitenum id="MODE__1" value="0x1" description="Timer is in periodic mode"/></bitfield><bitfield id="ENABLE" description="Enable bit  " begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Timer disabled"/><bitenum id="ENABLE__1" value="0x1" description="Timer enabled"/></bitfield></register><register id="INTCLR2" width="32" offset="0x2C" internal="0" description="Timer 2 Interrupt Clear Register"><bitfield id="INTCLR" description="Any write to the T32INTCLR2 register clears the interrupt outpu" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="RIS2" width="32" offset="0x30" internal="0" description="Timer 2 Raw Interrupt Status Register"><bitfield id="RAW_IFG" description="Raw interrupt status from the counter" begin="0" end="0" width="1" rwaccess="R/W"/></register><register id="MIS2" width="32" offset="0x34" internal="0" description="Timer 2 Interrupt Status Register"><bitfield id="IFG" description="Enabled interrupt status from the counter" begin="0" end="0" width="1" rwaccess="R/W"/></register><register id="BGLOAD2" width="32" offset="0x38" internal="0" description="Timer 2 Background Load Register"><bitfield id="BGLOAD" description="Contains the value from which the counter decrements" begin="31" end="0" width="32" rwaccess="R/W"/></register></module>